conf/Catalogs/ИнформационныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИнформационныеБазы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьОткрыватьКонфигуратор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредупреждатьПередОткрытиемПредприятия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнформационныхБаз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКПапке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяБазыНаСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкоростьСоединения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СкоростьСоединения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПлатформы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииПлатформы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмпортированоИзСтандартногоСписка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресВебСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

conf/Enums/ТипыИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыИнформационныхБаз</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файловая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Серверная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСерверная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

conf/Catalogs/ИнформационныеБазы/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ЗначениеЗаполнено(ЭтотОбъект.Родитель)
		И НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Родитель, "ЭтоГруппа")
		Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя создавать элемент на основании элемента (не группы)", , , , Отказ);
		Возврат;
	КонецЕсли;
	
	
	Если НЕ ЭтотОбъект.ЭтоНовый() Тогда
		ПредыдущийТип = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Ссылка, "Тип");
		Если ПредыдущийТип = Перечисления.ТипыИнформационныхБаз.Файловая И ЭтотОбъект.Тип <> ПредыдущийТип Тогда
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ТипСмененСФайловойНаДругой", Истина);
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ПутьКУдаляемойПапке", ЭтотОбъект.ПутьКПапке);
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтотОбъект.Тип = Перечисления.ТипыИнформационныхБаз.Файловая Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ПутьКПапке) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен путь к папке ИБ", ЭтотОбъект, "ПутьКПапке", "ПутьКПапке", Отказ);
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			ЭтотОбъект.ИмяСервера = Неопределено;
			ЭтотОбъект.ИмяБазыНаСервере = Неопределено;
			ЭтотОбъект.АдресВебСервера = Неопределено;
		КонецЕсли;
		
	ИначеЕсли ЭтотОбъект.Тип = Перечисления.ТипыИнформационныхБаз.Серверная Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ИмяСервера) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено имя сервера ИБ", ЭтотОбъект, "ИмяСервера", "ИмяСервера", Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ИмяБазыНаСервере) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено имя базы на сервере", ЭтотОбъект, "ИмяБазыНаСервере", "ИмяБазыНаСервере", Отказ);
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			ЭтотОбъект.ПутьКПапке = Неопределено;
			ЭтотОбъект.АдресВебСервера = Неопределено;
		КонецЕсли;
		
	ИначеЕсли ЭтотОбъект.Тип = Перечисления.ТипыИнформационныхБаз.ВебСерверная Тогда
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.АдресВебСервера) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен адрес веб-сервера", ЭтотОбъект, "АдресВебСервера", "АдресВебСервера", Отказ);
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			ЭтотОбъект.ПутьКПапке = Неопределено;
			ЭтотОбъект.ИмяСервера = Неопределено;
			ЭтотОбъект.ИмяБазыНаСервере = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтотОбъект.ЭтоНовый() Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоЗаписьНового", Истина);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Идентификатор) Тогда
		ЭтотОбъект.Идентификатор = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Тип) Тогда
		ЭтотОбъект.Тип = ПредопределенноеЗначение("Перечисление.ТипыИнформационныхБаз.Файловая");
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЭтотОбъект.Тип = Перечисления.ТипыИнформационныхБаз.Файловая Тогда
		ПроверяемыеРеквизиты.Добавить("ПутьКПапке");
		
	ИначеЕсли ЭтотОбъект.Тип = Перечисления.ТипыИнформационныхБаз.Серверная Тогда
		ПроверяемыеРеквизиты.Добавить("ИмяСервера");
		ПроверяемыеРеквизиты.Добавить("ИмяБазыНаСервере");
		
	ИначеЕсли ЭтотОбъект.Тип = Перечисления.ТипыИнформационныхБаз.ВебСерверная Тогда
		ПроверяемыеРеквизиты.Добавить("АдресВебСервера");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
